Repository: GamemakerChina/GMS2_manual_en2ch
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Paste clipboard to brush / paste copied frame
zh_cn: 从剪贴板粘贴画刷/被复制的帧

source: Paste the selected frames
zh_cn: 粘贴所选帧

source: Pasted image is larger than the canvas
zh_cn: 粘贴的图像比画布大

source: Patch Package
zh_cn: 程序包补丁

source: Patching
zh_cn: 打补丁

source: Patching Error
zh_cn: 修补错误

source: Path
zh_cn: 路径

source: Path Editor
zh_cn: 路径编辑器

source: Path Ended
zh_cn: 路径结束

source: Path Information
zh_cn: 路径信息

source: Path Layer
zh_cn: 路径层

source: Path Layer Editor
zh_cn: 路径层编辑器

source: Path To Merge Tool
zh_cn: 合并工具的路径?

source: Path To Tool
zh_cn: 工具的路径

source: Path colour
zh_cn: 路径颜色

source: Path to Android SDK
zh_cn: Android SDK 路径

source: Path to Browser
zh_cn: 浏览器地址

source: Path to Browser:
zh_cn: 浏览器路径：

source: Path to Diff tool
zh_cn: 差异工具（Diff Tool）路径

source: Path to FolderSync Tool
zh_cn: FolderSync工具的路径

source: Path to Keystore
zh_cn: 密钥库的路径

source: Path to Merge Tool
zh_cn: 合并工具路径

source: Path to Private Key
zh_cn: 私钥路径

source: Path to Public Key
zh_cn: 公共密钥路径

source: Path to Remote Runtime
zh_cn: 远程运行库（Remote Runtime）的路径

source: Path to Steam SDK
zh_cn: Steam SDK 路径

source: Path to Tool
zh_cn: 工具路径

source: Path to VS2015 (14.0)
zh_cn: VS2015 (14.0) 路径

source: Path to clone to:
zh_cn: 克隆到的路径：

source: Path: {0}
zh_cn: 路径： {0}

source: Paths
zh_cn: 路径

source: Paths Label Colour
zh_cn: 路径标签颜色

source: Paths background colour
zh_cn: 路径背景颜色

source: Paths icon colour
zh_cn: 路径图标颜色

source: Pause
zh_cn: 暂停

source: Pause All Audio
zh_cn: 暂停所有音频

source: Pause Audio
zh_cn: 暂停音频

source: Pause Particle System
zh_cn: 暂停粒子系统

source: Pause a sound effect or a music track.
zh_cn: 暂停一个音效或者音乐音轨的播放。

source: Pause all audio.
zh_cn: 暂停所有音频。

source: Pause or resume the particle system.
zh_cn: 暂停或者恢复粒子系统。

source: Paused
zh_cn: 被暂停

source: Pauses the game
zh_cn: 暂停游戏

source: Pen (D)
zh_cn: 笔(D)

source: Per Step
zh_cn: 每步

source: Percent
zh_cn: 百分比

source: Perform data file scan
zh_cn: 执行数据文件扫描

source: Perhaps this remainder is used as some kind of order or something, whatever the reason, getting a remainder is as simple as doing an AND:
zh_cn: 或许，这个余数可以被用于某些指令或者什么别的东西当中，不考虑原因，获取余数简单到用一个位与运算就能完成：

source: Period (.)
zh_cn: 点 (.)

source: Permissions
zh_cn: 权限

source: Persistent
zh_cn: 保持

source: Phone
zh_cn: 电话

source: Physics
zh_cn: 物理

source: Physics Collision Shape
zh_cn: 物理碰撞盒形状

source: Physics Functions
zh_cn: 物理功能

source: Physics Joint Constants
zh_cn: 物理关节常量

source: Physics Properties
zh_cn: 物理属性

source: Physics Variables
zh_cn: 物理变量

source: Pinch End
zh_cn: 捏合结束

source: Pinch In
zh_cn: 捏合放大

source: Pinch Out
zh_cn: 捏合缩小

source: Pinch Start
zh_cn: 捏合开始

source: Ping pong
zh_cn: 往返

source: Pitch
zh_cn: 音调

source: Pixel
zh_cn: 像素

source: Pixels
zh_cn: 像素

source: Pixels To Meters
zh_cn: 像素-米 比例尺

source: Platform
zh_cn: 平台

source: Platform Preferences
zh_cn: 平台首选项

source: Platform Settings
zh_cn: 平台设置

source: Platform Specific Saving/Loading
zh_cn: 特定平台的存取

source: Platform:
zh_cn: 平台：

source: Platforms:
zh_cn: 平台：

source: Play
zh_cn: 播放

source: Play Animation
zh_cn: 播放动画

source: Play Audio
zh_cn: 播放音频

source: Play a sound effect or a music track.
zh_cn: 播放一个音效或者一个音乐音轨。

source: Play all sounds in group
zh_cn: 播放组中所有声音

source: Play once
zh_cn: 单次播放

source: Play or pause the sprite animation.
zh_cn: 播放或暂停精灵动画。

source: Play sound
zh_cn: 播放声音

source: Play/Pause animation
zh_cn: 播放/暂停动画

source: PlayStation 4 Tools Missing
zh_cn: PlayStation 4 Tools 缺失

source: Playback Options
zh_cn: 回放选项

source: Playback position
zh_cn: 播放位置

source: Please amend or revert the style.
zh_cn: 请改正或修复样式。

source: Please cancel the import and rename your project resources.
zh_cn: 请取消导入并重命名项目资源。

source: Please check that none of the files are open in external programs.
zh_cn: 请检查没有文件是通过外部程序打开的。

source: Please check the path.
zh_cn: 请检查路径。

source: Please check your internet connection and start GameMaker Studio 2 again.
zh_cn: 请检查您的互联网连接并再次启动GameMaker Studio 2。

source: Please check your project and try again.
zh_cn: 请检查你的项目并重试。

source: Please check your setup and try again.
zh_cn: 请检查你的安装，然后重试。

source: Please close it first
zh_cn: 请先关闭它

source: Please commit and push first
zh_cn: 请先提交并推送。

source: Please complete your profile to continue.
zh_cn: 请填写您的个​​人资料以继续。

source: Please consider using cloud storage for this target.
zh_cn: 请考虑为此目标使用云存储。

source: Please ensure it is set correctly
zh_cn: 请确保设置正确

source: Please ensure it is set correctly.
zh_cn: 请确保它被正确设定。

source: Please enter a new name and try again.
zh_cn: 请重命名远程工作者（Remote Worker），然后重试。

source: Please make sure you have a working internet connection and try again.
zh_cn: 请确保你有一个在工作的互联网连接，然后再试一次。

source: Please name your Remote Worker and try again.
zh_cn: 请重命名远程工作者（Remote Worker），然后重试。

source: Please note that if you do not call surface_reset_target after you have finished, nothing will be drawn on the screen as all further drawing (even in other instances) will be done on the surface.
zh_cn: 请注意如果完成之后没有调用 surface_reset_target ，接下来屏幕上什么都不会绘制（即使是其它实例），而是绘制到了表面上。

source: Please note that there is no guarantee that remote push notifications will be delivered, and that the allowed data payload is fairly small.
zh_cn: 请注意，远程推送通知不能保证一定传递成功，并且允许传送的数据的负载也非常小。

source: Please note that these are coordinates based on the surface size and not on the position at which the surface is being drawn in the room (see the main page on Surfaces for further information).
zh_cn: 请注意，这些坐标是基于表面层大小的一个位置，而不是表面层在房间内绘制的位置 （查看 表面层 目录页获取详细信息）。

source: Please note that to start drawing to a surface you must first have called the function surface_set_target and then this one after you have finished, for each surface target that you have set or else nothing will be drawn on the screen as all further drawing (even in other instances) will be done on the surface.
zh_cn: 请注意，开始绘制到表面时必须调用这个函数surface_set_target，然后 对于每个你设置的表面层完成绘制时是这个函数，否则接下来将什么也不会绘制到屏幕上(即使是其它的实例) ，而是都绘制到了这个表面层上。

source: Please note, however, that using return ends the script, and so no actions placed after it has been used will be executed, and this means that a certain amount of thought has to go into how your scripts are structured.
zh_cn: 然而请注意，使用return将会结束该脚本，并且被放置于其后的动作都不再会被执行，并且这也就意味着，你需要考虑你的脚本是如何构造的。

source: Please open the Authoring Editor to create one
zh_cn: 请打开创作编辑器（Authoring Editor）创建一个

source: Please provide the required information.
zh_cn: 请提供所需信息。

source: Please provide the signing identity that you wish to use here, this should be a Developer ID Application identity and should be present in your Mac's login keychain certificates.
zh_cn: 请提供在这里使用的签名身份，这应该是一个开发者ID应用身份，并且应该在你的Mac登录钥匙扣证书里?。

source: Please provide the signing identity that you wish to use\nhere: this should be a Developer ID Application identity and should be present\nin your Mac's login keychain certificates.
zh_cn: 请在这提供您希望使用的签名身份\n：这应该是开发者ID应用程序标识，并且应该出现在您的Mac登录钥匙串证书中。

source: Please provide the signing identity that you\nwish to use here, this should be a Developer ID Application identity and should\nbe present in your Mac's login keychain certificates.
zh_cn: 请提供在这里使用的签名身份，这应该是一个开发者ID的应用身份，并且应该在你的Mac登录钥匙扣证书里?。

source: Please see the article Porting A GM:S 1.4 Game To GameMaker Studio 2 on the YoYo Games Knowledge Base and the section of the manual that covers Obsolete Functions and Compatibility Scripts.
zh_cn: 请阅读YoYo Games知识库（Knowledge Base）上的文章 Porting A GM:S 1.4 Game To GameMaker Studio 2 以及本手册上讲述 弃用函数（Obsolete Functions）及兼容性脚本（Compatibility Scripts） 的章节。

source: Please see the article Porting A GMS Game To GameMaker Studio 2 on the YoYo Games Knowledge Base and the section of the manual that covers Obsolete Functions and Compatibility Scripts.
zh_cn: 请阅读YoYo Games知识库（Knowledge Base）上的文章Porting A GMS Game To GameMaker Studio 2以及本手册上讲述弃用函数（Obsolete Functions）及兼容性脚本（Compatibility Scripts）的章节。

source: Please see the output panel for more details.
zh_cn: 详情请参阅输出面板。

source: Please select a language
zh_cn: 请选择一个语言

source: Please select an image using the file browser
zh_cn: 请使用文件浏览器选择一个图片

source: Please select the name and package ID of your asset from the marketplace
zh_cn: 请从市场中选择资产的名称和程序包ID

source: Please try pasting again in a few seconds.
zh_cn: 请尝试在几秒钟内重新粘贴。

source: Please try restarting GameMaker Studio 2.
zh_cn: 请尝试重启 GameMaker Studio 2。

source: Plugins
zh_cn: 插件

source: Plugins Git SCM Preferences
zh_cn: 插件 Git SCM 偏好设置

source: Plus(+) / Numpad Plus
zh_cn: 加号(+) / 小键盘加号

source: Point size
zh_cn: 点大小

source: Pointer
zh_cn: 指针

source: Polygon tool
zh_cn: 多边形工具

source: Polygon tool - filled
zh_cn: 多边形工具 - 填充

source: Polygon tool - outline
zh_cn: 多边形工具 - 轮廓

source: Poor
zh_cn: 较差

source: Pop Stack
zh_cn: 出栈

source: Pop a value off a stack.
zh_cn: 将一个值弹出堆栈。

source: Port
zh_cn: 端口

source: Port for Debugger to use
zh_cn: 调试器使用的端口

source: Port is invalid.
zh_cn: 端口无效。

# Port {0} is unavailable for spawning help! Please change this in Preferences
source: Port {0} is unavailable for spawning help!\nPlease change this in Preferences
zh_cn: 端口 {0} 不可用，无法生成帮助页面！\n请在偏好设置中更改此项。

source: Portrait
zh_cn: 纵向

source: Portrait Splash Screen
zh_cn: 纵向启动画面

source: Position
zh_cn: 位置

source: Position (0-1)
zh_cn: 位置 (0-1)

source: Post cursor intellisense colour
zh_cn: 光标后面智能提示文本的颜色（状态栏中）

source: Post draw event
zh_cn: Post draw 事件（发布绘制事件）

source: Post-Draw
zh_cn: 绘制后处理

source: Power Of 2 Check
zh_cn: 检查是否为 2 的次方数

source: Power Saving
zh_cn: 省电管理

source: Pre And Post Draw
zh_cn: 预绘制与后绘制

source: Pre cursor intellisense colour
zh_cn: 光标前面智能提示文本的颜色（状态栏中）

source: Pre-Draw
zh_cn: 绘制预处理

source: Pre-draw event
zh_cn: Pre-draw 事件

source: Pre-populate SDK values to chosen API Level
zh_cn: 将SDK值预填写到所选的API级别

source: Precise (Slow)
zh_cn: 精确(慢)

source: Precise Per Frame (Slow)
zh_cn: 精确各帧 (慢)

source: Precision:
zh_cn: 精度：

source: Prefer External
zh_cn: 首选外部

source: Preferences
zh_cn: 偏好设定

source: Preferences - Dialogue Editor
zh_cn: 偏好设置 - 对话框编辑器（Dialogue Editor）

source: Preferences - Drag and Drop
zh_cn: 偏好设置 - 拖拽按钮（Drag and Drop）

source: Preferences - Extension Editor
zh_cn: 偏好设置 - 扩展编辑器（Extension Editor）

source: Preferences - General
zh_cn: 偏好设置 - 常规（General）

source: Preferences - Image Editor
zh_cn: 偏好设置 - 图像编辑器（Image Editor）

source: Preferences - Language
zh_cn: 偏好设置 - 语言

source: Preferences - Marketplace
zh_cn: 偏好设置 - 市场

source: Preferences - Object Editor
zh_cn: 偏好设置 - 物体编辑器

source: Preferences - Plugins
zh_cn: 偏好设置 - 插件

source: Preferences - Resource Tree
zh_cn: 偏好设置 - 资源树

source: Preferences - Room Editor
zh_cn: 偏好设置 - 房间编辑器

source: Preferences - Runtime Feeds
zh_cn: 偏好设置 - 运行库下载源（Runtime Feeds）

source: Preferences - Spline Editor
zh_cn: 偏好设置 - 样条曲线（Spline）编辑器

source: Preferences - Sprite Editor
zh_cn: 偏好设置 - 精灵编辑器

source: Preferences - Text Editors
zh_cn: 偏好设置 - 文本编辑器

source: Preferences - Tile Set Editor
zh_cn: 偏好设置 - 图块集编辑器

source: Preferences - Timelines
zh_cn: 偏好预设 - 时间轴

source: Premultiply Alpha
zh_cn: 预乘Alpha值

source: Premultiply the alpha channel into the sprite frame
zh_cn: 将alpha通道预乘到精灵帧中

source: Prepend output .js with
zh_cn: 对输出的.js文件开头插入下列内容

source: Presets
zh_cn: 预设

source: Press ${open_search_replace} to open the Search and Replace window.
zh_cn: 按下 ${open_search_replace} 打开查找和替换窗口

source: Press CTRL+SHIFT+F to open the Search and Replace window.
zh_cn: 按 CTRL+SHIFT+F 打开查找和替换窗口。

source: Press {0}
zh_cn: 单击 {0}

source: Pressing this button will clear the current asset compiler cache.
zh_cn: 按下此按钮可以清除工程编译缓存。

source: Prev Page
zh_cn: 上一页

source: Preview
zh_cn: 预览

source: Preview (Read-Only)
zh_cn: 预览 （只读）

source: Preview Looped
zh_cn: 循环预览

source: Preview Mask
zh_cn: 预览笼罩

source: Preview sound
zh_cn: 预览声音

source: Previewing Frames:
zh_cn: 预览帧：

source: Previous Page
zh_cn: 上一页

source: Previous Patch
zh_cn: 上一个补丁

source: Previous Region
zh_cn: 前一区域

source: Previous X Coordinate
zh_cn: 之前的X坐标

source: Previous Y Coordinate
zh_cn: 之前的Y坐标

source: Previous frame
zh_cn: 上一帧

source: PrimitiveBuilder out of vertex space in {0}
zh_cn: 图元构建器（PrimitiveBuilder）超出{0}中的顶点空间

source: PrimitiveBuilder was not called finished correctly, you MUST call End()
zh_cn: 图元构建器（PrimitiveBuilder）没有被正确调用，你必须调用End()

source: Prismatic Joints
zh_cn: 棱柱关节

source: Probably not so, think about reducing the sample rate here to 11025 or 22050 for effects, and for longer things like music or for looping effects think also about using a compressed format.
zh_cn: 可能并不是这样，考虑将采样率降至 11025 或 22050 以获得相近的效果，对于音乐或循环效果等持续时间较长的音效，也可考虑使用压缩格式。

source: Processing...
zh_cn: 处理中...

source: Product
zh_cn: 产品

source: Product ID
zh_cn: 产品 ID

source: Product Id
zh_cn: 产品 Id

source: Product Information
zh_cn: 产品信息

source: Profile
zh_cn: 剖析

source: Profile Incomplete
zh_cn: 个人资料不完整

source: Profiling
zh_cn: Profiling（调试分析）

source: Profiling...
zh_cn: 分析中...

source: Progress Bar
zh_cn: 进度条

source: Project '{0}' does not exist
zh_cn: 项目 '{0}' 不存在

source: Project Cache Path
zh_cn: 项目缓存路径

source: Project Deleted
zh_cn: 项目已删除

source: Project Directory Modified
zh_cn: 项目目录被修改

source: Project Directory Reconnected
zh_cn: 项目目录重新连接

source: Project Directory Unavailable
zh_cn: 项目目录不可用

source: Project Error
zh_cn: 项目错误

source: Project GUID
zh_cn: 项目 GUID

source: Project Image Generator
zh_cn: 项目图像生成器

source: Project Last Changed
zh_cn: 项目最后更改

source: Project Missing
zh_cn: 项目丢失

source: Project Modified
zh_cn: 项目已修改

source: Project Name
zh_cn: 项目名称

source: Project Required
zh_cn: 项目要求

source: Project Start Date
zh_cn: 项目起始日期

source: Project Use Time
zh_cn: 项目用时

source: Project Views
zh_cn: 项目视图

source: Project already has repository!
zh_cn: 项目已经有了存储库！

source: Project archive detected
zh_cn: 项目文档检测

source: Project contains Spine assets - please accept the Spine licence agreement to proceed
zh_cn: 项目包含Spine资产 - 请接受Spine许可协议以继续

source: Project directory '{0}' has been reconnected.
zh_cn: 项目目录 '{0}' 已经连接。

source: Project directory '{0}' has had a large number of changes detected.
zh_cn: 项目目录 '{0}' 监测到大量更新。

source: Project directory '{0}' is no longer available you may be unable to save progress until the directory is reconnected
zh_cn: 工程目录 '{0}'不在可用，在目录重新连接之前您可能无法保存进度

source: Project directory '{0}' is no longer available you will be unable to save progress until the directory is reconnected
zh_cn: 项目目录 '{0}' 不再可用，你将无法保存进度，直到目录重新连接。

source: Project file detected
zh_cn: 检测到项目文件

source: Project files are saved with the *.yyp file extension.
zh_cn: 项目文件被保存为*.yyp扩展名的文件。

source: Project load failed.
zh_cn: 项目加载失败。

source: Project:
zh_cn: 项目：

source: Projects
zh_cn: 工程（Projects）

source: Promote
zh_cn: 提升

source: Promoting a configuration cannot be undone
zh_cn: 提升一个配置的操作不能撤消

source: Pronunciation Files
zh_cn: 发音文件

source: Properties
zh_cn: 属性

source: Properties - {0}
zh_cn: 属性 - {0}

source: Properties frame colour
zh_cn: 未锁定项的属性框颜色

source: Provisioning
zh_cn: 供应(?)

source: Provisioning Certificate
zh_cn: 配置证书（Provisioning Certificate）

source: Proxy
zh_cn: 代理

source: Proxy Domain.
zh_cn: 代理域名。

source: Proxy Files:
zh_cn: 代理文件：

source: Proxy Settings
zh_cn: 代理设置

source: Proxy Support
zh_cn: 代理支持

source: Proxy address and port (http://address:port)
zh_cn: 代理地址和端口 (http://address:port)

source: Proxy password
zh_cn: 代理密码

source: Proxy settings
zh_cn: 代理设置

source: Proxy username
zh_cn: 代理用户名

source: Published {1}.
zh_cn: 发布 {1}.

source: Publisher
zh_cn: 发布者

source: Publisher Account Required
zh_cn: 发布者帐户要求

source: Publisher Display Name
zh_cn: 发布者显示名称

source: Publisher ID
zh_cn: 发布者 ID

source: Publisher Id
zh_cn: 发布者 Id

source: Publisher Name
zh_cn: 发布者名称

source: Publisher Name:
zh_cn: 发布者名称︰

source: Pull Changes
zh_cn: 拉取变动

source: Pull Complete
zh_cn: 拉取完成

source: Pulley Joints
zh_cn: 滑轮关节

source: Pulling...
zh_cn: 正在拉取...

source: Purchasing Spine from Esoteric Software grants permission to create and distribute GameMaker applications using Spine animations
zh_cn: 从 Esoteric Software 购买Spine，授予使用 Spine 动画创建和分发 GameMaker 应用程序的权限

source: Push Changes
zh_cn: 推送变动

source: Push Complete
zh_cn: 推送完成

source: Push Notifications
zh_cn: 推送通知

source: Push Onto Stack
zh_cn: 压栈

source: Push a value onto a stack.
zh_cn: 将一个值压入堆栈。

source: Pushing...
zh_cn: 正在推送...

source: Put it this way, what's quicker, copying 32Mbytes or data, or 4Mbytes?
zh_cn: 这么说吧，拷贝一个32兆字节的数据和4兆字节的数据，那个更快？

source: Quality:
zh_cn: 品质：

source: Quick Buttons
zh_cn: 快捷功能按钮

source: Quick Start Guide
zh_cn: 快速入门指南

source: Quit
zh_cn: 放弃

source: RGBA Input
zh_cn: RGBA 输入

source: RMB Menu
zh_cn: 右键菜单

source: ROOMS
zh_cn: 房间函数

source: Radio Button
zh_cn: 单选按钮

source: Radio Button Group
zh_cn: 单选按钮组

source: Radio Buttons
zh_cn: 单选按钮

source: Radius {0}
zh_cn: 半径 {0}

source: Rain
zh_cn: 雨

source: Random
zh_cn: 随机

source: Randomize
zh_cn: 随机化

source: Randomly chooses one of the supplied arguments.
zh_cn: 随机从所提供参数中选出一个。

source: Rather use all the children objects and only use the parent in situations like those I have outlined above, for collision, for referencing variables, etc...
zh_cn: 相反使用所有的孩子对象，只能在上面列出的情况下使用父类，用于碰撞，引用变量等。

source: Rating
zh_cn: 评级

source: Ratings
zh_cn: 评分

source: Ratings XML
zh_cn: 评级 XML

source: Raw DPI value
zh_cn: 原DPI值

source: Re-login to update local licence
zh_cn: 重新登录以更新本地许可证

source: Read
zh_cn: 读

source: Read Buffer
zh_cn: 读取缓冲区

source: Read Ini File
zh_cn: 读取ini文件

source: Read Only
zh_cn: 只读

source: Read Only Line Numbers
zh_cn: 只读行号

source: Read a string or numeric value from an ini file.
zh_cn: 从一个ini文件中读取一个字符串或数字。

source: Read from a buffer.
zh_cn: 从缓冲区中读取。

source: Read only line style
zh_cn: 只读行样式

source: Real
zh_cn: 实数

source: Real numbers are any value that is not a string, nor any of the other possible data types.
zh_cn: 实数可以是任何一个既不是字符串也不是其他数据类型的值，它就是一个数值而已。

source: Really Bad
zh_cn: 很差

source: Recalculate tile set after resize
zh_cn: 重置大小后重新计算图块集。

source: Recent Projects
zh_cn: 最近项目

source: Recent Tutorials
zh_cn: 最近教程

source: Recent Windows
zh_cn: 最近窗口

source: Recently Used
zh_cn: 最近使用

source: Rectangle
zh_cn: 矩形

source: Rectangle (Fast)
zh_cn: 矩形(快)

source: Rectangle (R)
zh_cn: 矩形(R)

source: Rectangle select tool
zh_cn: 矩形框选择工具

source: Rectangle tool
zh_cn: 矩形工具

source: Rectangle tool - filled
zh_cn: 矩形工具 - 填充

source: Rectangle tool - outline
zh_cn: 矩形工具 - 轮廓

source: Rectangle with rotation
zh_cn: 带旋转的矩形

source: Red
zh_cn: 红

source: Redefine Keys
zh_cn: 重定义键位

source: Redo
zh_cn: 重做

source: Referencing an array will not copy it and be faster to parse.
zh_cn: 引用一个数组更快，它不是会复制。

source: Refresh Tutorials
zh_cn: 刷新教程

source: Refresh from Mac
zh_cn: 从Mac刷新

source: Refresh library.
zh_cn: 刷新库。

source: Refresh owned demos.
zh_cn: 刷新拥有的演示工程。

source: Refresh owned tutorials.
zh_cn: 刷新拥有的教程。

source: Regardless of the platforms you have available, you will always have a Main game option resource for setting up project specific things like the game speed.
zh_cn: 无论您提供的平台是什么，您将始终拥有一个 主要 的游戏选项资源来设置特定项目，如游戏速度等。

source: Regenerate Current
zh_cn: 重新生成当前布局

source: Regenerate Layouts
zh_cn: 重新生成布局

source: Regions
zh_cn: 区域

source: Register
zh_cn: 注册

source: Register File Associations
zh_cn: 注册文件关联

source: Relative
zh_cn: 相对

source: Relative To Direction
zh_cn: 相对于方向

source: Release Notes
zh_cn: 版本说明

source: Releasing it will disable it again
zh_cn: 松开该键则会再次禁用该选项

source: Reload
zh_cn: 重新载入

source: Reload Images
zh_cn: 重新载入图片

source: Remember Me
zh_cn: 记住我

source: Remember Packaging Option?
zh_cn: 记住打包选项？

source: Remember that the GUI layer is always made to fit the size of the display or game window, or the application surface, so setting this value to anything other than 1 basically scales the pixel count along the width and height.
zh_cn: 记住，GUI层一向是主动适应显示器或游戏窗口的大小，或者应用表面层，所以设置这个为除1之外的任何其它值，基本是根据它们的宽高缩放像素值。

source: Remind me later
zh_cn: 稍后提醒我

source: Remote Notifications
zh_cn: 远程通知

source: Remote Worker
zh_cn: 远程工作者?

source: Remote Worker - Platform Not Supported
zh_cn: 远程工作者（Worker） - 平台不受支持

source: Remote Worker Error
zh_cn: 远程工作者错误

source: Remote Worker Name Error
zh_cn: 远程工作者命名错误

source: Remote Worker was left blank.
zh_cn: 远程工作者（Remote Worker）留空。

source: Remote Workers
zh_cn: 远程工作者

source: Remote notification messages are sent by a server to a service provided by the device platform App Store, and this then forwards those messages onto all the devices on which your application is installed.
zh_cn: 远程通知由对应平台的应用商店提供的推送服务发送，通知将会被发送到所有安装了你的应用的设备上。

source: Remove
zh_cn: 移除

source: Remove Active Test Layouts
zh_cn: 移除激活的测试布局

source: Remove All
zh_cn: 移除全部

source: Remove Argument
zh_cn: 移除参数

source: Remove Browser
zh_cn: 移除浏览器

source: Remove Colour
zh_cn: 移除颜色

source: Remove Column(s)
zh_cn: 删除列

source: Remove Device
zh_cn: 移除设备

source: Remove Favourite
zh_cn: 删除最喜爱

source: Remove From Current View
zh_cn: 从当前视野中移除

source: Remove From List
zh_cn: 从列表中删除

source: Remove Gadget
zh_cn: 删除部件

source: Remove Group
zh_cn: 删除组

source: Remove Item(s)
zh_cn: 删除项

source: Remove Layout Group
zh_cn: 删除布局组

source: Remove Local Files
zh_cn: 删除本地文件

source: Remove Macro
zh_cn: 删除宏常量

source: Remove Map Entry
zh_cn: 移除映射项

source: Remove Permission
zh_cn: 移除权限

source: Remove Proxy File
zh_cn: 删除代理文件

source: Remove Row(s)
zh_cn: 删除行

source: Remove Selected
zh_cn: 删除所选

source: Remove a map entry.
zh_cn: 移除一个映射项。

source: Remove a value from a list.
zh_cn: 从列表中删除一个值。

source: Remove child
zh_cn: 移除子项

source: Remove selected framework
zh_cn: 移除选中的框架

source: Remove selected points from the path
zh_cn: 从路径上移除所选路径点

source: Remove this item
zh_cn: 删除此项

source: Remove this variable
zh_cn: 删除此变量

source: Removing instance reference from builtin - line {0} : {1}
zh_cn: 从内建移除实例引用 - 第{0}行 : {1}

source: Rename
zh_cn: 重命名

source: Rename Configuration
zh_cn: 重命名配置

source: Rename File
zh_cn: 重命名文件

source: Rename Group
zh_cn: 重命名组

source: Rename Layer
zh_cn: 重命名层

source: Rename Layout Group
zh_cn: 重命名布局组

source: Rename a file.
zh_cn: 重命名一个文件。

source: Rename the current focused auto-tile or animation set
zh_cn: 重命名当前被聚焦的自动图块或动画集

source: Rename the selected resource
zh_cn: 重命名所选资源

source: Renaming failed: unable to restore directory '{0}' to its original name.
zh_cn: 重命名失败：无法将目录 '{0}' 还原到其原始名称。

source: Renaming failed: unable to restore files to their correct state.
zh_cn: 重命名失败：无法将文件还原到其正确的状态。

source: Render States
zh_cn: 渲染状态

source: Renew
zh_cn: 续订

source: Repeat
zh_cn: 重复循环（Repeat）

source: Repeat code a number of times.
zh_cn: 重复一段代码若干次。

source: Replace
zh_cn: 替换

source: Replace All
zh_cn: 替换全部

source: Replace Next
zh_cn: 替换下一个

source: Replace all frames
zh_cn: 更换所有帧

source: Replace existing event?
zh_cn: 替换现有事件？

source: Replace the existing {0} event, or paste as a new event?
zh_cn: 替换现有的{0}事件，还是粘贴为新事件？

source: Replace...
zh_cn: 替换...

source: Replace:
zh_cn: 替换：

source: Report a Bug
zh_cn: 报告Bug

source: Repository URL
zh_cn: 存储库 URL

source: Repository created successfully
zh_cn: 成功创建存储库

source: Repository field cannot be empty
zh_cn: 库字段不能为空

source: Repository to import project into:
zh_cn: 将项目导入的存储库：

source: Require Audio Recording
zh_cn: 需要录音

source: Require Game Chat
zh_cn: 需要游戏聊天

source: Require Xbox Live
zh_cn: 需要 Xbox Live

source: Require audio recording
zh_cn: 需要音频记录

source: Require game chat
zh_cn: 需要游戏聊天

source: Required
zh_cn: 需要

source: Required SDKs
zh_cn: 必需的SDK

source: Required fields missing
zh_cn: 缺步必要的字段

source: Requirements
zh_cn: 要求

source: Requires Worker
zh_cn: 需求工作者（Worker）

source: Reserved Tag Name
zh_cn: 预留的标签名称

source: Reset
zh_cn: 重置

source: Reset Layout
zh_cn: 重置布局

source: Reset Window Layout
zh_cn: 重置窗口布局

source: Reset Windows On Current Desktop
zh_cn: 在当前桌面重置窗口

source: Reset Zoom
zh_cn: 重置缩放

source: Reset Zoom (${room_area_zoom_reset})
zh_cn: 重置缩放 (${room_area_zoom_reset})
